In [ ]:
# WELCOME TO PANDAS SERIES. A PANDAS SERIES IS A SINGLE DIMENTIONAL ARRAY (VECTOR) 
   
    import pandas as pd

# IN  PANDAS SERIES THE .SERIES METHOD IS USED.
# AND IT CONSIST OF INDEX AND VALUES.

In [4]:
number = [1, 2, 3]
pd.Series(number)

0    1
1    2
2    3
dtype: int64

In [56]:
y = pd.Series([0, 4, 8])
y

0    0
1    4
2    8
dtype: int64

In [5]:
man = ['orange', 2, None]
pd.Series(man)

0    orange
1         2
2      None
dtype: object

In [6]:
val = [1, 4, None] 
pd.Series(val)

# IN A PANDAS SERIES, IF A LIST CONTAINS 2 INTEGERS AND A NONE DATA TYPE THE OUTPUT TURNS TO A FLOAT

0    1.0
1    4.0
2    NaN
dtype: float64

In [9]:
big = [ 3, 5, 7, 3, 2.6, None] 
pd.Series(big)      

# BUT ONCE U ADD A STRING THE VALUE CHANGES          
# BUT WHEN ITS JUST NUMBERS AND NONE THE VALUES BEOMES A FLOAT

0    3.0
1    5.0
2    7.0
3    3.0
4    2.6
5    NaN
dtype: float64

In [11]:
# ON A DICTIONARY, THE .SERIES METHOD CONVERTS THE KEYS TO INDEX, AND VALUES TO VALUES.

names = {'man': 'mango',
         'jane': 'jenny',
         'prince': 'scotland',
         'princess': 'diana',
         'queen': 'elizabeth'}
s = pd.Series(names)
s

man             mango
jane            jenny
prince       scotland
princess        diana
queen       elizabeth
dtype: object

In [12]:
s.index

Index(['man', 'jane', 'prince', 'princess', 'queen'], dtype='object')

In [13]:
s.values

array(['mango', 'jenny', 'scotland', 'diana', 'elizabeth'], dtype=object)

In [14]:
# TO PASS IN YOUR INDEX AND VALUES SEPERATELY DO THIS BELOW


s = pd.Series(['man', 'tiger', 'origin'], index =['champane', 'cocktail', 'alaska'])
s

champane       man
cocktail     tiger
alaska      origin
dtype: object

In [15]:
#   QUERRING A SERIES

currency = {'nigeria': 'naira',
            'america': 'dollar',
            'england': 'pounds',
            'china': 'yuan'}
s= pd.Series(currency)
s

nigeria     naira
america    dollar
england    pounds
china        yuan
dtype: object

In [17]:
# WHEN QUARYING IN PANDAS WE USE .ILOC (INTEGER LOC) TO QUERY THE INDEX OF THE VALUES

s.iloc[2]

'pounds'

In [18]:
s.iloc[3]

'yuan'

In [19]:
s.iloc[0]

'naira'

In [20]:
#  YOU CAN QUERY OUT A VALUE IN PANDAS DICTIONARY USING ITS INDEX KEY.AND THE .LOC ATTRIBUTE IS USED

s.loc['nigeria']

'naira'

In [21]:
s.loc['china']

'yuan'

In [22]:
s = pd.Series([100.00, 300.00, 500.00, 400.0])
s

0    100.0
1    300.0
2    500.0
3    400.0
dtype: float64

In [25]:
#  TO ADD NUMBERS IN PANDAS SERIES

total = 0
for item in s:
    total = total + item
print(total)

1300.0

In [26]:
import numpy as np

total = np.sum(s)
print(total)

1300.0

In [27]:
# LEN IS USED TO DETERMINE THE LENGHT OF A PANDAS SERIES

len(s)

4

In [29]:
# ADDING TO A PANDAS SERIES

s = pd.Series([1, 3, 6])
s

0    1
1    3
2    6
dtype: int64

In [30]:
#  TO ADD TO AN EXISTING PANDAS SERIES WE USE .LOC AND THE INDEX FOLLOWED BY THE VALUE

s.loc['monopoly'] = 'Mineral'
s

0                 1
1                 3
2                 6
monopoly    Mineral
dtype: object

In [31]:
s.loc['nigeria'] = 'jagajaga'
s

0                  1
1                  3
2                  6
monopoly     Mineral
nigeria     jagajaga
dtype: object

In [34]:
#  INTRODUCTION TO PANDAS DATAFRAME: A PANDAS DATA FRAME IS A MULTI-DIMENTIONAL ARRAY
# WE CAN MERGE MANY PANDAS SERIES TOGETHER TO GET A PANDAS DATAFRAME

details_1 = ({'name': 'adamna',
             'surname': 'tony',
             'email': 'hilda24@gmail.com',
             'password': 'emanuel'})

details_2 = ({'name': 'ayo',
             'surname': 'odudu',
             'email': 'ayodudu@gmail.com',
             'password': 'odudu24'})

details_3 = ({'name': 'chima',
             'surname': 'chike',
             'email': 'chimachike02@gmail.com',
             'password': 'chike999'})

#   WHEN EVER A DF IS CALLED IN A PANDAS DATAFRAME THE INDEX AUTOMATICALLY TURNS TO A COLUME NAME,

df = pd.DataFrame([details_1, details_2, details_3],index = ['location 1', 'location 2', 'location 3'])
df
# YOU CAN NAME THE INDEX BY ADDING ANYTHING YOU WANT E.G LOCATION 1 ETC.

              name surname                   email  password
location 1  adamna    tony       hilda24@gmail.com   emanuel
location 2     ayo   odudu       ayodudu@gmail.com   odudu24
location 3   chima   chike  chimachike02@gmail.com  chike999

In [35]:
#  TO QUERY A PANDAS DATA FRAME USE DF.LOC AND THE INDEX NAME TO QUERY THE VALUE
df.loc['location 1']

name                   adamna
surname                  tony
email       hilda24@gmail.com
password              emanuel
Name: location 1, dtype: object

In [36]:
df.loc['location 2']

name                      ayo
surname                 odudu
email       ayodudu@gmail.com
password              odudu24
Name: location 2, dtype: object

In [37]:
#  TO QUERY OUT A PARTICULAR COLUMN USE THE INDEX NAME AND COLUMN.

df.loc['location 2', 'email']

'ayodudu@gmail.com'

In [38]:
#  TRANSPOSE MEANS TO SWAP THINGS. TO TRANSPOSE IN PD DATAFRAME, THE INDEX AUTOMATICALY CHANGES.

df.T

                 location 1         location 2              location 3
name                 adamna                ayo                   chima
surname                tony              odudu                   chike
email     hilda24@gmail.com  ayodudu@gmail.com  chimachike02@gmail.com
password            emanuel            odudu24                chike999

In [40]:
# TO GET ONLY THE EMAIL IN TRANSPOSE
df.T.loc['email']

location 1         hilda24@gmail.com
location 2         ayodudu@gmail.com
location 3    chimachike02@gmail.com
Name: email, dtype: object

In [41]:
df.T.loc['password']

location 1     emanuel
location 2     odudu24
location 3    chike999
Name: password, dtype: object

In [42]:
# df.loc[:, THIS MEANS QUERY OUT ALL THE ROWS AND THEN PRINT THE NAMES AN PASSWORDS.

df.loc[:,['name', 'password']]

              name  password
location 1  adamna   emanuel
location 2     ayo   odudu24
location 3   chima  chike999

In [43]:
df.loc[:,['email', 'surname']]

                             email surname
location 1       hilda24@gmail.com    tony
location 2       ayodudu@gmail.com   odudu
location 3  chimachike02@gmail.com   chike

In [44]:
#  DROPING A COLUMN FROM A DATAFRAME WE USE DF.DROP E.G
    
df.drop(['location 2']) # by default it drops the index

              name surname                   email  password
location 1  adamna    tony       hilda24@gmail.com   emanuel
location 3   chima   chike  chimachike02@gmail.com  chike999

In [45]:
df

              name surname                   email  password
location 1  adamna    tony       hilda24@gmail.com   emanuel
location 2     ayo   odudu       ayodudu@gmail.com   odudu24
location 3   chima   chike  chimachike02@gmail.com  chike999

In [48]:
# DROPING FROM THE COLUMN

df.drop(['name'], axis = 1)

           surname                   email  password
location 1    tony       hilda24@gmail.com   emanuel
location 2   odudu       ayodudu@gmail.com   odudu24
location 3   chike  chimachike02@gmail.com  chike999

In [49]:
#  DATAFRAME INDEXING AND LOADING

df

              name surname                   email  password
location 1  adamna    tony       hilda24@gmail.com   emanuel
location 2     ayo   odudu       ayodudu@gmail.com   odudu24
location 3   chima   chike  chimachike02@gmail.com  chike999

In [50]:
name = df['name']
name

location 1    adamna
location 2       ayo
location 3     chima
Name: name, dtype: object

In [51]:
surname = df['surname']
surname

location 1     tony
location 2    odudu
location 3    chike
Name: surname, dtype: object

In [53]:
#  TO GET A PASSWORD FROM A PARTICULAR INDEX.

password = df['password'].loc['location 2']
password

'odudu24'

In [54]:
email = df['email'].loc['location 1']
email

'hilda24@gmail.com'